ti-cortex-m4/tm4c1294ncpdt/ek-tm4c1294xl/project2/self/uart/serial.c
    // If flow control is enabled and asserted, don't enable the transmitter.
    // Otherwise, enable it.
    if(!((g_sParameters.sPort[ulPort].ucFlowControl ==
          SERIAL_FLOW_CONTROL_HW) &&
         GPIOPinRead(g_ulFlowInBase[ulPort], g_ulFlowInPin[ulPort])))
    {
        HWREG(g_ulUARTBase[ulPort] + UART_O_CTL) |= UART_CTL_TXE;
    }
}
#endif
//*****************************************************************************
//! Checks the availability of the serial port output buffer.
//!
//! \param ulPort is the UART port number to be accessed.
//!
//! This function checks to see if there is room on the UART transmit buffer
//! for additional data.
//!
//! \return Returns the number of bytes available in the serial transmit ring
//! buffer.
//*****************************************************************************
bool SerialSendFull(uint32_t ulPort)
{
    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);

    // Return the number of bytes available in the tx ring buffer.
    return(RingBufFull(&g_sTxBuf[ulPort]));
}

//*****************************************************************************
//! Sends a character to the UART.
//!
//! \param ulPort is the UART port number to be accessed.
//! \param ucChar is the character to be sent.
//!
//! This function sends a character to the UART.  The character will either be
//! directly written into the UART FIFO or into the UART transmit buffer, as
//! appropriate.
//!
//! \return None.
//*****************************************************************************
void SerialSend(uint32_t ulPort, uint8_t ucChar)
{
    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);

    // Disable the UART transmit interrupt while determining how to handle this
    // character.  Failure to do so could result in the loss of this character,
    // or stalled output due to this character being placed into the UART
    // transmit buffer but never transferred out into the UART FIFO.
    UARTIntDisable(g_ulUARTBase[ulPort], UART_INT_TX);

    // See if the transmit buffer is empty and there is space in the FIFO.
    if(RingBufEmpty(&g_sTxBuf[ulPort]) &&
       (UARTSpaceAvail(g_ulUARTBase[ulPort])))
    {
        // Write this character directly into the FIFO.
        UARTCharPut(g_ulUARTBase[ulPort], ucChar);
    }

    // See if there is room in the transmit buffer.
    else if(!RingBufFull(&g_sTxBuf[ulPort]))
    {
        // Put this character into the transmit buffer.
        RingBufWriteOne(&g_sTxBuf[ulPort], ucChar);
    }

    // Enable the UART transmit interrupt.
    UARTIntEnable(g_ulUARTBase[ulPort], UART_INT_TX);
}

//*****************************************************************************
//! Receives a character from the UART.
//!
//! \param ulPort is the UART port number to be accessed.
//!
//! This function receives a character from the relevant port's UART buffer.
//!
//! \return Returns -1 if no data is available or the oldest character held in
//! the receive ring buffer.
//*****************************************************************************
long SerialReceive(uint32_t ulPort)
{
    uint32_t ulData;

    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);

    // See if the receive buffer is empty and there is space in the FIFO.
    if(RingBufEmpty(&g_sRxBuf[ulPort]))
    {
        // Return -1 (EOF) to indicate no data available.
        return(-1);
    }

    // Read a single character.
    ulData = (long)RingBufReadOne(&g_sRxBuf[ulPort]);

#ifdef SERIAL_FLOW_CONTROL
    // If flow control is enabled, check the status of the RX buffer to
    // determine if flow control GPIO needs to be de-asserted.
    if(g_sParameters.sPort[ulPort].ucFlowControl == SERIAL_FLOW_CONTROL_HW)
    {
        // If the ring buffer is down to less than 25% used,
        // de-assert the outbound flow control pin.
        if((RingBufUsed(&g_sRxBuf[ulPort]) <
            (RingBufSize(&g_sRxBuf[ulPort]) / 4)) &&
           (g_ulSetFlowOutValue[ulPort] == 0))
        {
            GPIOPinWrite(g_ulFlowOutBase[ulPort], g_ulFlowOutPin[ulPort], 0);
        }
    }
#endif

    // Return the data that was read.
    return(ulData);
}

//*****************************************************************************
//! Returns number of characters available in the serial ring buffer.
//!
//! \param ulPort is the UART port number to be accessed.
//!
//! This function will return the number of characters available in the
//! serial ring buffer.
//!
//! \return The number of characters available in the ring buffer.
//*****************************************************************************
uint32_t SerialReceiveAvailable(uint32_t ulPort)
{
    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);

    // Return the value.
    return(RingBufUsed(&g_sRxBuf[ulPort]));
}

#if false
//*****************************************************************************
//! Configures the serial port baud rate.
//!
//! \param ulPort is the serial port number to be accessed.
//! \param ulBaudRate is the new baud rate for the serial port.
//!
//! This function configures the serial port's baud rate.  The current
//! configuration for the serial port will be read.  The baud rate will be
//! modified, and the port will be reconfigured.
//!
//! \return None.
//*****************************************************************************
void
SerialSetBaudRate(uint32_t ulPort, uint32_t ulBaudRate)
{
    uint32_t ulDiv, ulUARTClk;

    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);
    ASSERT(ulBaudRate != 0);

    // Save the baud rate for future reference.
    g_ulCurrentBaudRate[ulPort] = ulBaudRate;

    // Get and check the clock use by the UART.
    ulUARTClk = SysCtlClockGet();
    ASSERT(ulUARTClk >= (ulBaudRate * 16));

    // Stop the UART.
    UARTDisable(g_ulUARTBase[ulPort]);

    // Compute the fractional baud rate divider.
    ulDiv = (((ulUARTClk * 8) / ulBaudRate) + 1) / 2;

    // Set the baud rate.
    HWREG(g_ulUARTBase[ulPort] + UART_O_IBRD) = ulDiv / 64;
    HWREG(g_ulUARTBase[ulPort] + UART_O_FBRD) = ulDiv % 64;

