ti-cortex-m4/tm4c1294ncpdt/ek-tm4c1294xl/project2/self/uart/serial.c
    // Clear the flags register.
    HWREG(g_ulUARTBase[ulPort] + UART_O_FR) = 0;

    // Start the UART.
    SerialUARTEnable(ulPort);
}

//*****************************************************************************
//! Queries the serial port baud rate.
//!
//! \param ulPort is the serial port number to be accessed.
//!
//! This function will read the UART configuration and return the currently
//! configured baud rate for the selected port.
//!
//! \return The current baud rate of the serial port.
//*****************************************************************************
uint32_t
SerialGetBaudRate(uint32_t ulPort)
{
    uint32_t ulCurrentBaudRate, ulCurrentConfig, ulDif, ulTemp;

    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);

    // Get the current configuration of the UART.
    UARTConfigGetExpClk(g_ulUARTBase[ulPort], SysCtlClockGet(),
                        &ulCurrentBaudRate, &ulCurrentConfig);

    // Calculate the difference between the reported baud rate and the
    // stored nominal baud rate.
    if(ulCurrentBaudRate > g_ulCurrentBaudRate[ulPort])
    {
        ulDif = ulCurrentBaudRate - g_ulCurrentBaudRate[ulPort];
    }
    else
    {
        ulDif = g_ulCurrentBaudRate[ulPort] - ulCurrentBaudRate;
    }

    // Calculate the 1% value of nominal baud rate.
    ulTemp = g_ulCurrentBaudRate[ulPort] / 100;

    // If the difference between calculated and nominal is > 1%, report the
    // calculated rate.  Otherwise, report the nominal rate.
    if(ulDif > ulTemp)
    {
        return(ulCurrentBaudRate);
    }

    // Return the current serial port baud rate.
    return(g_ulCurrentBaudRate[ulPort]);
}

//*****************************************************************************
//! Configures the serial port data size.
//!
//! \param ulPort is the serial port number to be accessed.
//! \param ucDataSize is the new data size for the serial port.
//!
//! This function configures the serial port's data size.  The current
//! configuration for the serial port will be read.  The data size will be
//! modified, and the port will be reconfigured.
//!
//! \return None.
//*****************************************************************************
void
SerialSetDataSize(uint32_t ulPort, uint8_t ucDataSize)
{
    uint32_t ulCurrentBaudRate, ulCurrentConfig, ulNewConfig;

    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);
    ASSERT((ucDataSize >= 5) && (ucDataSize <= 8));

    // Stop the UART.
    UARTDisable(g_ulUARTBase[ulPort]);

    // Get the current configuration of the UART.
    UARTConfigGetExpClk(g_ulUARTBase[ulPort], SysCtlClockGet(),
                        &ulCurrentBaudRate, &ulCurrentConfig);

    // Update the configuration with a new data length.
    switch(ucDataSize)
    {
        case 5:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_WLEN_MASK);
            ulNewConfig |= UART_CONFIG_WLEN_5;
            g_sParameters.sPort[ulPort].ucDataSize = ucDataSize;
            break;
        }

        case 6:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_WLEN_MASK);
            ulNewConfig |= UART_CONFIG_WLEN_6;
            g_sParameters.sPort[ulPort].ucDataSize = ucDataSize;
            break;
        }

        case 7:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_WLEN_MASK);
            ulNewConfig |= UART_CONFIG_WLEN_7;
            g_sParameters.sPort[ulPort].ucDataSize = ucDataSize;
            break;
        }

        case 8:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_WLEN_MASK);
            ulNewConfig |= UART_CONFIG_WLEN_8;
            g_sParameters.sPort[ulPort].ucDataSize = ucDataSize;
            break;
        }

        default:
        {
            ulNewConfig = ulCurrentConfig;
            break;
        }
    }

    // Set parity, data length, and number of stop bits.
    HWREG(g_ulUARTBase[ulPort] + UART_O_LCRH) = ulNewConfig;

    // Clear the flags register.
    HWREG(g_ulUARTBase[ulPort] + UART_O_FR) = 0;

    // Start the UART.
    SerialUARTEnable(ulPort);
}

//*****************************************************************************
//! Queries the serial port data size.
//!
//! \param ulPort is the serial port number to be accessed.
//!
//! This function will read the UART configuration and return the currently
//! configured data size for the selected port.
//!
//! \return None.
//*****************************************************************************
uint8_t
SerialGetDataSize(uint32_t ulPort)
{
    uint32_t ulCurrentBaudRate, ulCurrentConfig;
    uint8_t ucCurrentDataSize;

    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);

    // Get the current configuration of the UART.
    UARTConfigGetExpClk(g_ulUARTBase[ulPort], SysCtlClockGet(),
                        &ulCurrentBaudRate, &ulCurrentConfig);

    // Determine the current data size.
    switch(ulCurrentConfig & UART_CONFIG_WLEN_MASK)
    {
        case UART_CONFIG_WLEN_5:
        {
            ucCurrentDataSize = 5;
            break;
        }

        case UART_CONFIG_WLEN_6:
        {
            ucCurrentDataSize = 6;
            break;
        }

        case UART_CONFIG_WLEN_7:
        {
            ucCurrentDataSize = 7;
            break;
        }

        case UART_CONFIG_WLEN_8:
        {
            ucCurrentDataSize = 8;
            break;
        }

        default:
        {
            ucCurrentDataSize = 0;
            break;
        }
    }

    // Return the current data size.
    return(ucCurrentDataSize);
}

//*****************************************************************************
//! Configures the serial port parity.
//!
//! \param ulPort is the serial port number to be accessed.
//! \param ucParity is the new parity for the serial port.
//!
//! This function configures the serial port's parity.  The current
//! configuration for the serial port will be read.  The parity will be
//! modified, and the port will be reconfigured.
//!
//! \return None.
//*****************************************************************************
void
SerialSetParity(uint32_t ulPort, uint8_t ucParity)
{
    uint32_t ulCurrentBaudRate, ulCurrentConfig, ulNewConfig;

    // Check the arguments.
    ASSERT(ulPort < UART_COUNT);
    ASSERT((ucParity == SERIAL_PARITY_NONE) ||
           (ucParity == SERIAL_PARITY_ODD) ||
           (ucParity == SERIAL_PARITY_EVEN) ||
           (ucParity == SERIAL_PARITY_MARK) ||
           (ucParity == SERIAL_PARITY_SPACE));

